# Brewfile - Declarative packages for macOS without Nix

# Taps
tap "clojure/tools"
tap "facebook/fb"
tap "mobile-dev-inc/tap"
tap "my-monkeys/tap"

# Formulas (CLI Tools)
brew "git"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "jq"
brew "lazygit"
brew "neovim"
brew "tmux"
brew "starship"
brew "zsh-autocomplete"
brew "herdr"
brew "direnv"
brew "nvm"
brew "python@3.12"
brew "act"
brew "cocoapods"
brew "gemini-cli"
brew "gh"
brew "google-java-format"
brew "gradle"
brew "jenv"
brew "k6"
brew "maven"
brew "poetry"
brew "postgresql@15", restart_service: :changed
brew "tree"
brew "uv"

# Casks (GUI Applications & Fonts)
cask "wezterm"
cask "claude-code"
cask "codex"
cask "font-hack-nerd-font"
cask "intellij-idea-ce"
cask "mockoon"
cask "my-monkeys/tap/opensuperwhisper", trusted: true
cask "temurin@21"
cask "visual-studio-code"

# VS Code Extensions
vscode "augment.vscode-augment"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deepscan.vscode-deepscan"
vscode "deque-systems.vscode-axe-linter"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "editorconfig.editorconfig"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hediet.vscode-drawio"
vscode "humao.rest-client"
vscode "infeng.vscode-react-typescript"
vscode "irongeek.vscode-env"
vscode "jebbs.plantuml"
vscode "kisstkondoros.vscode-codemetrics"
vscode "kumar-harsh.graphql-for-vscode"
vscode "l13rary.l13-diff"
vscode "lcjuves.vscode-gjf"
vscode "ljacobsson.eventbridge-assistant"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mebrahtom.plantumlpreviewer"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "michelemelluso.gitignore"
vscode "mike-co.import-sorter"
vscode "million.million-lint"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.notepadplusplus-keybindings"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "octref.vetur"
vscode "olefjaerestad.vscode-circular-dependencies-finder"
vscode "openai.chatgpt"
vscode "oracle.oracle-java"
vscode "orta.vscode-twoslash-queries"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "qhoekman.language-plantuml"
vscode "rangav.vscode-thunder-client"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "redocly.openapi-vs-code"
vscode "rvest.vs-code-prettier-eslint"
vscode "sebastianbille.iam-legend"
vscode "sodatea.velocity"
vscode "steoates.autoimport"
vscode "streetsidesoftware.avro"
vscode "streetsidesoftware.code-spell-checker"
vscode "threadheap.serverless-ide-vscode"
vscode "tlent.jest-snapshot-language-support"
vscode "trabpukcip.wolf"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vue.volar"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-vscode"
vscode "well-ar.plantuml"
vscode "whosydd.carbon"
vscode "yoavbls.pretty-ts-errors"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
